websevice1/result1/Iteration1/t2_http.xml

<?xml-stylesheet href="..\http.xsl" type="text/xsl"?>
<report vuGenInstallDir="C:\Program Files (x86)\HP\LoadRunner">
  <http>
    <request>
      <header>POST /webservices/DomesticAirline.asmx HTTP/1.1
Content-Type: text/xml; charset=utf-8
Cache-Control: no-cache
SOAPAction: "http://WebXml.com.cn/getDomesticAirlinesTime"
User-Agent: Mozilla/4.0 (compatible; MSIE 6.0; MS Web Services Client Protocol 1.1.4322.2032)
Accept-Encoding: gzip, deflate
Accept: */*
Connection: Keep-Alive
Host: ws.webxml.com.cn
Content-Length: 835

</header>
      <body>&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"&gt;
  &lt;soap:Header&gt;
    &lt;wsa:Action&gt;http://WebXml.com.cn/getDomesticAirlinesTime&lt;/wsa:Action&gt;
    &lt;wsa:MessageID&gt;uuid:c314b26c-5022-44f1-8270-d376f3733e66&lt;/wsa:MessageID&gt;
    &lt;wsa:ReplyTo&gt;
      &lt;wsa:Address&gt;http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous&lt;/wsa:Address&gt;
    &lt;/wsa:ReplyTo&gt;
    &lt;wsa:To&gt;http://ws.webxml.com.cn/webservices/DomesticAirline.asmx&lt;/wsa:To&gt;
  &lt;/soap:Header&gt;
  &lt;soap:Body&gt;
    &lt;getDomesticAirlinesTime xmlns="http://WebXml.com.cn/"&gt;
      &lt;startCity&gt;SHA&lt;/startCity&gt;
      &lt;lastCity&gt;ZHA&lt;/lastCity&gt;
      &lt;theDate&gt;2016-11-08&lt;/theDate&gt;
      &lt;userID /&gt;
    &lt;/getDomesticAirlinesTime&gt;
  &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt;</body>
    </request>
    <response>
      <header>HTTP/1.1 200 OK
Date: Sun, 06 Nov 2016 08:13:37 GMT
Server: Microsoft-IIS/6.0
X-Powered-By: ASP.NET
X-AspNet-Version: 2.0.50727
Cache-Control: private, max-age=0
Content-Type: text/xml; charset=utf-8
Content-Length: 2271

</header>
      <body>&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"&gt;
  &lt;soap:Body&gt;
    &lt;getDomesticAirlinesTimeResponse xmlns="http://WebXml.com.cn/"&gt;
      &lt;getDomesticAirlinesTimeResult&gt;
        &lt;xs:schema id="Airlines" xmlns="" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:msdata="urn:schemas-microsoft-com:xml-msdata"&gt;
          &lt;xs:element name="Airlines" msdata:IsDataSet="true" msdata:UseCurrentLocale="true"&gt;
            &lt;xs:complexType&gt;
              &lt;xs:choice minOccurs="0" maxOccurs="unbounded"&gt;
                &lt;xs:element name="AirlinesTime"&gt;
                  &lt;xs:complexType&gt;
                    &lt;xs:sequence&gt;
                      &lt;xs:element name="Company" type="xs:string" minOccurs="0" /&gt;
                      &lt;xs:element name="AirlineCode" type="xs:string" minOccurs="0" /&gt;
                      &lt;xs:element name="StartDrome" type="xs:string" minOccurs="0" /&gt;
                      &lt;xs:element name="ArriveDrome" type="xs:string" minOccurs="0" /&gt;
                      &lt;xs:element name="StartTime" type="xs:string" minOccurs="0" /&gt;
                      &lt;xs:element name="ArriveTime" type="xs:string" minOccurs="0" /&gt;
                      &lt;xs:element name="Mode" type="xs:string" minOccurs="0" /&gt;
                      &lt;xs:element name="AirlineStop" type="xs:string" minOccurs="0" /&gt;
                      &lt;xs:element name="Week" type="xs:string" minOccurs="0" /&gt;
                    &lt;/xs:sequence&gt;
                  &lt;/xs:complexType&gt;
                &lt;/xs:element&gt;
              &lt;/xs:choice&gt;
            &lt;/xs:complexType&gt;
          &lt;/xs:element&gt;
        &lt;/xs:schema&gt;
        &lt;diffgr:diffgram xmlns:msdata="urn:schemas-microsoft-com:xml-msdata" xmlns:diffgr="urn:schemas-microsoft-com:xml-diffgram-v1"&gt;
          &lt;Airlines xmlns=""&gt;
            &lt;AirlinesTime diffgr:id="AirlinesTime1" msdata:rowOrder="0"&gt;
              &lt;Company&gt;东方航空&lt;/Company&gt;
              &lt;AirlineCode&gt;MU9387&lt;/AirlineCode&gt;
              &lt;StartDrome&gt;上海浦东国际机场&lt;/StartDrome&gt;
              &lt;ArriveDrome&gt;湛江机场&lt;/ArriveDrome&gt;
              &lt;StartTime&gt;16:40&lt;/StartTime&gt;
              &lt;ArriveTime&gt;19:25&lt;/ArriveTime&gt;
              &lt;Mode&gt;737&lt;/Mode&gt;
              &lt;AirlineStop&gt;0&lt;/AirlineStop&gt;
              &lt;Week&gt;123456日&lt;/Week&gt;
            &lt;/AirlinesTime&gt;
            &lt;AirlinesTime diffgr:id="AirlinesTime2" msdata:rowOrder="1"&gt;
              &lt;Company&gt;上海航空&lt;/Company&gt;
              &lt;AirlineCode&gt;FM9387&lt;/AirlineCode&gt;
              &lt;StartDrome&gt;上海浦东国际机场&lt;/StartDrome&gt;
              &lt;ArriveDrome&gt;湛江机场&lt;/ArriveDrome&gt;
              &lt;StartTime&gt;16:40&lt;/StartTime&gt;
              &lt;ArriveTime&gt;19:25&lt;/ArriveTime&gt;
              &lt;Mode&gt;737&lt;/Mode&gt;
              &lt;AirlineStop&gt;0&lt;/AirlineStop&gt;
              &lt;Week&gt;123456日&lt;/Week&gt;
            &lt;/AirlinesTime&gt;
          &lt;/Airlines&gt;
        &lt;/diffgr:diffgram&gt;
      &lt;/getDomesticAirlinesTimeResult&gt;
    &lt;/getDomesticAirlinesTimeResponse&gt;
  &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt;</body>
    </response>
  </http>
</report>